<a href="https://colab.research.google.com/github/kdstheace/Python-Study/blob/main/Day0324_Pandas_Review.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from pandas import DataFrame, Series
import pandas as pd
import numpy as np

In [ ]:
s = Series(list(range(10)), index=list('ABCDEFGHIJ'))
s

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

In [ ]:
df = DataFrame(list(range(10)), index=list('ABCDEFGHIJ'), dtype=np.float32, columns = ['Score'])
df

   Score
A    0.0
B    1.0
C    2.0
D    3.0
E    4.0
F    5.0
G    6.0
H    7.0
I    8.0
J    9.0

In [ ]:
dates = pd.date_range('20210301', periods = 10)
df1 = DataFrame(np.random.randn(10, 5), index = dates, columns = list('ABCDE'))
df1

                   A         B         C         D         E
2021-03-01 -0.424411 -0.740022  0.476000 -0.479969  0.764526
2021-03-02 -0.955026  1.590440 -0.231174  0.555422  0.566831
2021-03-03 -0.739055  1.246342 -0.650969 -1.204925 -1.240330
2021-03-04 -1.462869  0.991369 -0.146207  0.670939  1.510987
2021-03-05  1.233390 -0.202981 -2.428839 -0.690563 -0.015072
2021-03-06 -0.365844  0.838997 -0.428582  1.222150 -0.136723
2021-03-07 -1.692678  0.985792 -1.970798  0.243669  0.958160
2021-03-08 -0.378977  0.941028  0.642424 -0.105275 -0.556264
2021-03-09  0.032056  1.207903  0.768983 -0.908391  1.275736
2021-03-10  0.408816 -0.167868  1.108444 -1.446649 -0.299958

In [ ]:
# 속성들
'''
-dtypes: 데이터 타입 확인할 떄
-.index
-.values
-.columns
'''
df1.dtypes
df1.index
df1.columns

#중요함수
'''
- df1.describe()
- df1.sort_values()
'''
print(df1.describe())
print(df1.sort_values(axis=1, by = '2021-03-01', ascending=False))
print(df1.sort_values(axis=0, by = 'A', ascending=True))

               A          B          C          D          E
count  10.000000  10.000000  10.000000  10.000000  10.000000
mean   -0.434460   0.669100  -0.286072  -0.214359   0.282789
std     0.864283   0.762016   1.159811   0.878150   0.875055
min    -1.692678  -0.740022  -2.428839  -1.446649  -1.240330
25%    -0.901033   0.083848  -0.595372  -0.853934  -0.259149
50%    -0.401694   0.963410  -0.188691  -0.292622   0.275879
75%    -0.067419   1.153769   0.600818   0.477484   0.909752
max     1.233390   1.590440   1.108444   1.222150   1.510987
                   E         C         A         D         B
2021-03-01  0.764526  0.476000 -0.424411 -0.479969 -0.740022
2021-03-02  0.566831 -0.231174 -0.955026  0.555422  1.590440
2021-03-03 -1.240330 -0.650969 -0.739055 -1.204925  1.246342
2021-03-04  1.510987 -0.146207 -1.462869  0.670939  0.991369
2021-03-05 -0.015072 -2.428839  1.233390 -0.690563 -0.202981
2021-03-06 -0.136723 -0.428582 -0.365844  1.222150  0.838997
2021-03-07  0.958160 -1.970798 -1.692678  0.243669  0.985792
2021-03-08 -0.556264  0.642424 -0.378977 -0.105275  0.941028
2021-03-09  1.275736  0.768983  0.032056 -0.908391  1.207903
2021-03-10 -0.299958  1.108444  0.408816 -1.446649 -0.167868
                   A         B         C         D         E
2021-03-07 -1.692678  0.985792 -1.970798  0.243669  0.958160
2021-03-04 -1.462869  0.991369 -0.146207  0.670939  1.510987
2021-03-02 -0.955026  1.590440 -0.231174  0.555422  0.566831
2021-03-03 -0.739055  1.246342 -0.650969 -1.204925 -1.240330
2021-03-01 -0.424411 -0.740022  0.476000 -0.479969  0.764526
2021-03-08 -0.378977  0.941028  0.642424 -0.105275 -0.556264
2021-03-06 -0.365844  0.838997 -0.428582  1.222150 -0.136723
2021-03-09  0.032056  1.207903  0.768983 -0.908391  1.275736
2021-03-10  0.408816 -0.167868  1.108444 -1.446649 -0.299958
2021-03-05  1.233390 -0.202981 -2.428839 -0.690563 -0.015072

In [ ]:
#데이터 추출
print(df1)
print(df1.iloc[:2])
print(df1.iloc[[1, 2, 5],[0, 2]])

                   A         B         C         D         E
2021-03-01 -0.424411 -0.740022  0.476000 -0.479969  0.764526
2021-03-02 -0.955026  1.590440 -0.231174  0.555422  0.566831
2021-03-03 -0.739055  1.246342 -0.650969 -1.204925 -1.240330
2021-03-04 -1.462869  0.991369 -0.146207  0.670939  1.510987
2021-03-05  1.233390 -0.202981 -2.428839 -0.690563 -0.015072
2021-03-06 -0.365844  0.838997 -0.428582  1.222150 -0.136723
2021-03-07 -1.692678  0.985792 -1.970798  0.243669  0.958160
2021-03-08 -0.378977  0.941028  0.642424 -0.105275 -0.556264
2021-03-09  0.032056  1.207903  0.768983 -0.908391  1.275736
2021-03-10  0.408816 -0.167868  1.108444 -1.446649 -0.299958
                   A         B         C         D         E
2021-03-01 -0.424411 -0.740022  0.476000 -0.479969  0.764526
2021-03-02 -0.955026  1.590440 -0.231174  0.555422  0.566831
                   A         C
2021-03-02 -0.955026 -0.231174
2021-03-03 -0.739055 -0.650969
2021-03-06 -0.365844 -0.428582

In [ ]:
print(df1.loc['2021-03-02' : '2021-03-06', 'B':'D'])

                   B         C         D
2021-03-02  1.590440 -0.231174  0.555422
2021-03-03  1.246342 -0.650969 -1.204925
2021-03-04  0.991369 -0.146207  0.670939
2021-03-05 -0.202981 -2.428839 -0.690563
2021-03-06  0.838997 -0.428582  1.222150

In [ ]:
dates = pd.date_range('20210301', periods = 10)
df1 = DataFrame(np.random.randn(10, 5), index = dates, columns = list('ABCDE'))
print(df1)
#문제 1행1열의 값을 3으로 바꿔라1

df2 = df1[df1['C'] > 0]
print(df2)
df2.iloc[0]['A'] = 3
print(df2)
print(df1)

In [ ]:
dates = pd.date_range('20210301', periods = 10)
df1 = DataFrame(np.random.randn(10, 5), index = dates, columns = list('ABCDE'))

df1['f'] = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(df1)
df1['g'] = Series(data = [5, 6], index=['2021-03-04', '2021-03-02'], dtype=np.float64)
df1['h'] = Series(data = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
df1

                   A         B         C         D         E   f
2021-03-01 -1.288775  0.885678  0.855227 -0.080537  0.182316   1
2021-03-02  1.346331 -0.015959  0.532529 -0.435446 -0.325326   2
2021-03-03  0.281912  0.982854 -0.621060  0.311870 -0.782122   3
2021-03-04  0.824383 -0.140887 -1.705712  0.349163 -0.214134   4
2021-03-05 -0.214277  1.391592 -0.252763  0.773764 -1.680973   5
2021-03-06  0.711237 -0.060407 -0.327481  1.137253 -0.149205   6
2021-03-07 -0.272798 -0.146381 -0.433016  1.167930  0.103508   7
2021-03-08 -0.383980 -1.394521  1.149982 -1.461715  0.714513   8
2021-03-09 -0.028438  0.647000 -0.543442  0.458534  1.464494   9
2021-03-10 -0.647730 -0.378466 -0.608315  1.228104  0.357550  10

                   A         B         C         D         E   f   g   h
2021-03-01 -1.288775  0.885678  0.855227 -0.080537  0.182316   1 NaN NaN
2021-03-02  1.346331 -0.015959  0.532529 -0.435446 -0.325326   2 NaN NaN
2021-03-03  0.281912  0.982854 -0.621060  0.311870 -0.782122   3 NaN NaN
2021-03-04  0.824383 -0.140887 -1.705712  0.349163 -0.214134   4 NaN NaN
2021-03-05 -0.214277  1.391592 -0.252763  0.773764 -1.680973   5 NaN NaN
2021-03-06  0.711237 -0.060407 -0.327481  1.137253 -0.149205   6 NaN NaN
2021-03-07 -0.272798 -0.146381 -0.433016  1.167930  0.103508   7 NaN NaN
2021-03-08 -0.383980 -1.394521  1.149982 -1.461715  0.714513   8 NaN NaN
2021-03-09 -0.028438  0.647000 -0.543442  0.458534  1.464494   9 NaN NaN
2021-03-10 -0.647730 -0.378466 -0.608315  1.228104  0.357550  10 NaN NaN

In [ ]:
raw_data = {
    '이름' : ['홍길동', '전우치', '손오공', '사오정', '저팔계'],
    '나이' : [32, 37, 30, 31, 33],
    '전화번호' : ['010-1111-2222', '010-231-2222','010-8111-2522','010-1471-2222', '010-3456-3785'],
    '지역' : ['서울','대구','용인','제주','속초']
}
df = DataFrame(raw_data, columns=['이름','나이','전화번호','지역'])
df1 = DataFrame(raw_data, columns=['이름','나이','전화번호','성별'], index=['A','B','C','D','E'])
df1

s = Series(data=['남','여','남'], index = ['A', 'B', 'E'])
df1['성별'] = s
df1

    이름  나이           전화번호   성별
A  홍길동  32  010-1111-2222    남
B  전우치  37   010-231-2222    여
C  손오공  30  010-8111-2522  NaN
D  사오정  31  010-1471-2222  NaN
E  저팔계  33  010-3456-3785    남

In [ ]:
dates = pd.date_range('20210301', periods = 10)
df1 = DataFrame(np.random.randn(10, 5), index = dates, columns = list('ABCDE'))
print(df1)

df3 = df1[df1 > 0]
df3

                   A         B         C         D         E
2021-03-01 -0.506575  0.945690  1.653507  0.351404 -1.536649
2021-03-02  0.072682  0.088100 -0.858378 -0.317449  0.451941
2021-03-03  3.248688  0.688432  0.193446 -1.104890  0.603543
2021-03-04  0.981054 -2.148292  1.336635  0.321642 -1.492164
2021-03-05 -0.133456  0.365704  0.887587  0.742341  1.459648
2021-03-06  0.865636 -1.263894 -1.739807  1.537826 -1.738594
2021-03-07  2.027140 -1.299502 -0.168946  0.063549  2.257059
2021-03-08  0.483094 -0.048542 -1.310138 -0.382485 -1.291104
2021-03-09 -1.103541 -0.430115 -0.216868 -0.596702 -0.277432
2021-03-10  0.323561 -0.682633 -1.006520  0.468237 -0.308503

                   A         B         C         D         E
2021-03-01       NaN  0.945690  1.653507  0.351404       NaN
2021-03-02  0.072682  0.088100       NaN       NaN  0.451941
2021-03-03  3.248688  0.688432  0.193446       NaN  0.603543
2021-03-04  0.981054       NaN  1.336635  0.321642       NaN
2021-03-05       NaN  0.365704  0.887587  0.742341  1.459648
2021-03-06  0.865636       NaN       NaN  1.537826       NaN
2021-03-07  2.027140       NaN       NaN  0.063549  2.257059
2021-03-08  0.483094       NaN       NaN       NaN       NaN
2021-03-09       NaN       NaN       NaN       NaN       NaN
2021-03-10  0.323561       NaN       NaN  0.468237       NaN

In [ ]:
dates = pd.date_range('20210301', periods = 10)
df1 = DataFrame(np.random.randn(10, 5), index = dates, columns = list('ABCDE'))
print(df1)

df3 = df1[df1 > 0] #dropna
df4 = df1[df1 > 0] #fillna

print(df3.dropna(axis=0, how='any'))
print(df4.fillna(0))

In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [24]:
a = Series(range(1, 6), index = list('ABCDE'))
a

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [25]:
b = Series(range(4, 10), index = list('BCDEFG'))
b

B    4
C    5
D    6
E    7
F    8
G    9
dtype: int64

In [28]:
print(a+b)
print(a.add(b))

A     NaN
B     6.0
C     8.0
D    10.0
E    12.0
F     NaN
G     NaN
dtype: float64

A     NaN
B     6.0
C     8.0
D    10.0
E    12.0
F     NaN
G     NaN
dtype: float64

In [30]:
df1 = DataFrame(np.arange(9).reshape(3,3), columns=list('ABC'))
df1

   A  B  C
0  0  1  2
1  3  4  5
2  6  7  8

In [31]:
df2 = DataFrame(np.arange(16).reshape(4, 4), columns= list('ABCD'))
df2

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [33]:
df1 + df2
df1.add(df2)

      A     B     C   D
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [47]:
c = Series(np.arange(10, 14), index=list('ABCD'))
c

A    10
B    11
C    12
D    13
dtype: int64

In [48]:
print(df2)
df2.add(c)

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

    A   B   C   D
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

In [41]:
d = Series(np.arange(10, 14))
d
df2.add(d)

    A   B   C   D   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

In [49]:
c.add(df2)

    A   B   C   D
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

In [50]:
df2 + c

    A   B   C   D
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

In [52]:
df2.add(c, axis = 0)

    A   B   C   D
0 NaN NaN NaN NaN
1 NaN NaN NaN NaN
2 NaN NaN NaN NaN
3 NaN NaN NaN NaN
A NaN NaN NaN NaN
B NaN NaN NaN NaN
C NaN NaN NaN NaN
D NaN NaN NaN NaN

In [54]:
df2.sub(c, axis = 0)

    A   B   C   D
0 NaN NaN NaN NaN
1 NaN NaN NaN NaN
2 NaN NaN NaN NaN
3 NaN NaN NaN NaN
A NaN NaN NaN NaN
B NaN NaN NaN NaN
C NaN NaN NaN NaN
D NaN NaN NaN NaN

In [55]:
df2.mul(c)

     A    B    C    D
0    0   11   24   39
1   40   55   72   91
2   80   99  120  143
3  120  143  168  195

In [57]:
df2.div(c)

     A         B         C         D
0  0.0  0.090909  0.166667  0.230769
1  0.4  0.454545  0.500000  0.538462
2  0.8  0.818182  0.833333  0.846154
3  1.2  1.181818  1.166667  1.153846

In [60]:
df1 = DataFrame({
     '번호' : [10, 20, 30, 40, 50, 60, 70],
     '이름' : ['홍길동','임꺽정','손오공','사오정','저팔계','전우치','삼장법사']
    })
df1

   번호    이름
0  10   홍길동
1  20   임꺽정
2  30   손오공
3  40   사오정
4  50   저팔계
5  60   전우치
6  70  삼장법사

In [62]:
df2 = DataFrame({
    '번호' : [10, 10, 20, 40, 50, 40, 40, 70 , 80],
    '금액' : [1000, 2500, 4500, 3000, 1100, 3200, 3550, 3510, 100]
})
df2

   번호    금액
0  10  1000
1  10  2500
2  20  4500
3  40  3000
4  50  1100
5  40  3200
6  40  3550
7  70  3510
8  80   100

In [65]:
df1.merge(df2) #inner join

   번호    이름    금액
0  10   홍길동  1000
1  10   홍길동  2500
2  20   임꺽정  4500
3  40   사오정  3000
4  40   사오정  3200
5  40   사오정  3550
6  50   저팔계  1100
7  70  삼장법사  3510

In [67]:

pd.merge(df1, df2, how='outer')

    번호    이름      금액
0   10   홍길동  1000.0
1   10   홍길동  2500.0
2   20   임꺽정  4500.0
3   30   손오공     NaN
4   40   사오정  3000.0
5   40   사오정  3200.0
6   40   사오정  3550.0
7   50   저팔계  1100.0
8   60   전우치     NaN
9   70  삼장법사  3510.0
10  80   NaN   100.0

In [68]:
pd.merge(df1, df2, how='left')

   번호    이름      금액
0  10   홍길동  1000.0
1  10   홍길동  2500.0
2  20   임꺽정  4500.0
3  30   손오공     NaN
4  40   사오정  3000.0
5  40   사오정  3200.0
6  40   사오정  3550.0
7  50   저팔계  1100.0
8  60   전우치     NaN
9  70  삼장법사  3510.0

In [69]:
pd.merge(df1, df2, how='right')

   번호    이름    금액
0  10   홍길동  1000
1  10   홍길동  2500
2  20   임꺽정  4500
3  40   사오정  3000
4  40   사오정  3200
5  40   사오정  3550
6  50   저팔계  1100
7  70  삼장법사  3510
8  80   NaN   100